<template>
  <div class="page">
    <div class="panel">
      <div class="txt">
        <p class="txt weight">
          我们深知个人信息对您而言的重要性，也感谢您对我们的信任。我们将通过本政策向您说明约苗会如何收集、存储、保护、使用及对外提供您的信息，并说明您享有的权利。本政策包含了约苗及相关服务页面（以下简称“本服务”或“约苗”）的隐私政策说明。本政策要点如下:
        </p>
        <p class="txt">
          (1)
          为了便于您了解您在使用我们的服务时，我们需要收集的信息类型与用途，我们将结合具体服务向您逐一说明。
        </p>
        <p class="txt">
          (2)
          为了向您提供服务所需，我们会按照合法、正当、必要的原则收集您的信息。若是自动采集的，则我们将按实现产品或服务的业务功能所必需的最低频率进行收集。
        </p>
        <p class="txt">
          (3)
          如果为了向您提供服务而需要将您的信息共享至第三方，我们将评估该第三方收集信息的合法性、正当性、必要性。我们将要求第三方对您的信息采取保护措施并且严格遵守相关法律法规与监管要求，且我们将与第三方确认权责。另外，我们会按照法律法规及国家标准的要求以确认协议、弹窗提示等形式征得您的同意或确认第三方已经征得您的同意。
        </p>
        <p class="txt">
          (4)
          如果为了向您提供服务而需要从第三方获取您的信息，我们将评估第三方信息来源的合法性；如果我们开展业务需进行的个人信息处理活动超出您原本向第三方提供个人信息时的授权范围，我们将征得您的明确同意。
        </p>
        <p class="txt">
          (5) 您可以通过本政策介绍的方式访问和管理您的信息或进行投诉举报。
        </p>
      </div>
      <div class="txt">
        您可以根据以下索引阅读相应章节，进一步了解本政策的具体约定：
        <p>一、我们如何收集和使用个人信息</p>
        <p>二、我们如何存储和保护个人信息</p>
        <p>三、我们如何对外提供信息</p>
        <p>四、您如何访问和管理自己的信息</p>
        <p>五、我们如何保护未成年人的信息</p>
        <p>六、对第三方责任的声明</p>
        <p>七、本政策的适用及更新</p>
        <p>八、联系我们</p>
      </div>
      <div class="txt">
        我们尊重并保护您的隐私。您使用我们的服务时，我们将按照隐私政策（以下简称“本政策”）收集、存储、使用及对外提供您的信息。同时，我们会通过本政策向您说明，我们如何为您提供访问、更新、管理和保护您的信息的服务。本政策与您使用我们的服务关系紧密，我们建议您在使用本服务前认真阅读、充分理解本政策条款，包括免除或限制我们责任的免责条款以及对使用本服务对您权利的限制条款，并做出您认为适当的选择，
        <span class="weight"
          >若您选择继续使用本服务即视为您已阅读并同意本政策条款</span
        >
        。我们努力用通俗易懂、简明扼要的文字表达，并对本政策中与您的权益存在重大关系的条款和个人敏感信息，采用粗体字进行标注以提示您注意。为了遵守国家法律法规及监管规定（例如：进行实名管理），也为了向您提供服务及提升服务质量，我们需要收集、存储、使用及对外提供您的信息。您同意我们按照本政策约定处理您的信息，以便您享受优质、便捷的服务，同时更好地保护您的帐号及信息安全。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">一、我们如何收集和使用个人信息</h3>
      <div class="txt">
        在您使用本服务的过程中，我们会按照如下方式收集和使用您在使用服务时主动提供、授权提供或因为使用服务而产生的信息，用以向您提供服务及优化服务质量：
        当您访问约苗首页时，您需要提供您本人的位置，收集位置信息是为了向您推荐您所在城市的的秒杀活动信息。
      </div>
      <div class="txt">
        1.1
        当您注册本服务帐号时，您需要提供您本人的您的身份证号码、微信头像、昵称、地区、性别和位置信息，收集、存储这些信息是为了帮助您完成注册使用，保护您的帐号安全。
      </div>
      <div class="txt">
        1.2
        当您使用约苗服务时，为保障您正常使用我们的服务，以及进行程序认证、升级，保障网络安全、运营安全，同时使本服务系统安全运维有据可查，有迹可寻，我们会收集您的：
        <p>
          (1)
          <span class="weight">设备所在位置相关信息</span>
          （如IP地址、位置信息、接入网络的方式和类型）；
        </p>
        <p>
          (2)
          <span class="weight">日志信息</span>
          （如操作日志、浏览器的类型、电信运营商、使用的语言、访问日期和时间以及访问时长、访问记录、您对我们服务的详细使用情况）；
        </p>
        <p>
          (3)
          <span class="weight">服务使用信息</span>
          （您在使用本服务时提交或产生的信息、用户行为信息）；
        </p>
        <p>
          (4)
          <span class="weight">手机号码</span>
          （在您授权同意的情况下）
        </p>
        这类信息是为提供服务必须收集的基础信息。必要时我们将申请调用您设备的存储和相册权限并在您授权同意的情况下收集必要信息。
      </div>
      <div class="txt">
        1.3
        当您选择附近门诊、选苗攻略页面，使用查看约苗科普内容、门诊信息、疫苗介绍、体检产品介绍的功能时，我们将使用您的手机号码、IP地址、微信昵称、头像、openID，以保障我们能为您提供更准确的信息。拒绝提供上述信息您只能查看首页信息，不可使用其他功能。
      </div>
      <div class="txt">
        1.4
        当您使用疫苗订阅服务、疫苗预约服务、体检预约服务、查看可以提供免费两癌筛查的门诊信息、订阅免费两癌筛查活动通知的功能时，我们将使用您的姓名、性别、手机号码、出生日期、身份证号码、
        现居地区来记录您的预约及订阅记录，以便为您提供适当的服务。
      </div>
      <div class="txt">
        1.5
        当您使用预约免费两癌筛查的功能时，我们将使用您的姓名、性别、出生日期、
        身份证号码、现居地区来记录您的预约记录，以便为您提供适当的服务。
      </div>
      <div class="txt">
        1.6
        当您使用本服务进行新冠肺炎疫苗接种需求信息登记时或新冠肺炎疫苗预约服务时，我们将根据接种需求登记或预约服务所需信息的需要，使用您的姓名、性别、出生日期、
        身份证号码、现居地区、户籍所在地、工作单位等来记录您的预约记录，以便为您提供适当的服务。
      </div>
      <div class="txt">
        1.7 当您使用秒杀服务功能时，我们将使用您的姓名、性别、出生日期、
        身份证号码、现居地区来记录您的秒杀记录，以便为您提供适当的服务。：
      </div>
      <div class="txt">
        1.8
        当您使用家庭成员管理功能时，我们将收集您家庭成员的姓名、性别、出生日期、现居地区信息，以便为您的家庭成员提供适当的服务。
      </div>
      <p>
        1.9 当您需使用本服务进行支付时，我们需收集您的
        <span class="weight"
          >支付账户用户ID、支付金额、订单信息、支付方式以及交易结果。</span
        >
        该等信息属于敏感信息，我们将采取加密保护措施。收集该等信息为实现本功能所必需，如您拒绝提供，请勿使用相关功能。
      </p>
      <p>
        1.10 当您自主使用保险功能时，第三方保险平台将收集您的
        <span class="weight">
          投保人姓名、手机号码、证件类型、证件号码、电子邮箱、被保人姓名、被保人身份证件、被保人出生日期、被保人性别、投保省市及投保门诊（仅投保疫苗险所需）、投保人与被保人的关系信息、保单号及电子保单信息。
        </span>
        该信息属于敏感信息，我们将采取加密保护措施，如您拒绝提供，请勿使用相关功能。当您需要存储或导入保单时，您需授权我们调用您设备的相册及存储权限，否则您将无法使用该功能。
      </p>
      <div class="txt">
        1.11
        用本服务与第三方系统/服务互通功能时，其他系统/服务的提供方在经您同意后可能将获取您主动公开或传输的相关信息，但我们将进行充分评估并严格施行最小化提供，您在选择前应充分了解第三方系统/服务的产品功能及信息保护策略。
        <p>我们收集的上述信息将被用于以下场景：</p>
        <p>(1) 实现前述内容中收集信息之目的；</p>
        <p>(2) 为您提供本服务及相关服务；</p>
        <p>
          (3)
          在我们提供本服务时，用于身份验证、安全防范、存档用途，确保本服务的安全性；
        </p>
        <p>(4) 帮助我们设计新服务、改善现有服务；</p>
        <p>(5) 向您提供与本服务相关的信息推送；</p>
        <p>(6) 软件认证或管理软件升级；</p>
        <p>(7) 使您能够参与关于本服务的调查。</p>
      </div>
      <div class="txt">
        1.12 当您自主使用保险功能时，第三方保险平台将收集您的
        <span class="weight">
          投保人姓名、手机号码、证件类型、证件号码、电子邮箱、被保人姓名、被保人身份证件、被保人出生日期、被保人性别、投保省市及投保门诊（仅投保疫苗险所需）、投保人与被保人的关系信息、保单号及电子保单信息。
        </span>
        <p>(1) 与个人信息控制者履行法律法规规定的义务相关的；</p>
        <p>(2) 与国家安全、国防安全直接相关的；</p>
        <p>(3) 与公共安全、公共卫生、重大公共利益直接相关的；</p>
        <p>(4) 与刑事侦查、起诉、审判和判决执行等直接相关的；</p>
        <p>
          (5)
          出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；
        </p>
        <p>(6) 所涉及的个人信息是个人信息主体自行向社会公众公开的；</p>
        <p>(7) 根据个人信息主体要求签订和履行合同所必需的；</p>
        <p>
          (8)
          从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
        </p>
        <p>
          (9)
          维护所提供产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；
        </p>
        <p>(10) 个人信息控制者为新闻单位，且其开展合法的新闻报道所必需的；</p>
        <p>
          (11)
          个人信息控制者为学术研究机构，出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的。；
        </p>
      </div>
      <div class="txt">
        1.13
        请您理解，我们向您提供的服务是不断更新和发展的。如我们基于服务所需收集、使用的信息超出前述说明范围的，我们会通过页面提示、协议约定的方式另行向您说明信息收集的范围与目的，并征得您的同意。我们会按照本政策以及相应的用户协议约定使用、存储、对外提供及保护您的信息；如您选择不提供前述信息，您将无法使用某项或某部分服务，但不影响您使用我们提供的其他服务。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">二、我们如何存储和保护个人信息</h3>
      <div class="txt">
        2.1 我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。
      </div>
      <div class="txt">
        2.2
        一般而言，我们仅为实现目的所必需的时间保留您的个人信息，当我们的产品或服务发生停止运营的情形时，我们将以推送通知、公告等形式通知您，并在合理的期限内删除您的个人信息或进行匿名化处理。
      </div>
      <div class="txt">
        2.3
        我们会采取合理的措施保护您及儿童的个人信息，以防止信息的丢失、泄露、损毁、非授权访问、非授权披露。我们将在合理的安全水平内使用各种安全保护措施以保障信息的安全。例如，我们会使用加密技术、匿名化处理、最小化访问权限等手段来保护您的个人信息。我们有严格的信息安全规定和流程，并有专门的信息安全团队在公司内部严格执行上述措施。若发生个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大。
      </div>
      <div class="txt">
        2.4
        请您理解，互联网环境并非百分之百安全，尽管我们有这些安全措施，但请注意在互联网上不存在“完善的安全措施”，我们将尽力确保您的信息的安全性。
      </div>
      <p class="txt weight">
        2.5
        请您务必妥善保管好您的帐号名及其他个人信息。您在使用本服务时，我们会通过您的帐号名及其他个人信息来识别您的身份。一旦您泄漏了前述信息，您可能会蒙受损失，并可能对您产生不利。如您发现约苗帐号及/或其他个人信息可能或已经泄露时，请您立即和我们取得联系，以便我们及时采取相应措施以避免或降低可能对您带来的不利。
      </p>
    </div>
    <div class="panel">
      <h3 class="title">三、我们如何对外提供信息</h3>
      <div class="txt">
        3.1
        我们不会与本服务提供者以外的公司、组织和个人提供您的个人信息，但以下情况除外：
        <p class="weight">(1) 在获得您的明确同意的情况下共享；</p>
        <p class="weight">
          (2) 根据法律规定、有法律赋予权限的政府部门要求的情况下共享；
        </p>
        <p class="weight">
          (3) 只有对外提供您的相关信息，才能实现相关功能服务：
        </p>
        <p class="weight">
          a.为向您发送验证及通知短信，我们使用了第三方短信服务SDK（软件服务工具包），将您向我们提供的手机号码提交给短信服务商及电信运营商；
        </p>
        <p class="weight">
          b.为了实现支付服务，我们使用了第三方支付机构的SDK，将您的订单信息提供您所选择的第三方支付机构；
        </p>
        <p class="weight">
          c.为了实现在线客服功能，本服务需与第三方客服系统api对接，需将您的账号ID及头像提供客服系统技术服务商；
        </p>
        <p class="weight">
          d.根据您自主选择使用1.3-1.6条所述预约功能的服务需要，向您所选的预防接种服务单位/体检单位服务人员展示您的姓名、性别、出生日期、身份证号码、手机号码、预约信息。
        </p>
        <p class="weight">
          e.为实现预防接种全流程数字化服务需要，您在使用预约接种服务时，向接种服务单位及其排队叫号、电子签核相关软件系统供应商与技术运维方提供受种者姓名、性别、手机号码、出生日期、预约门诊、预约日期与时段、预约疫苗信息。
        </p>
      </div>
      <div class="txt">
        3.2
        随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将开展个人信息安全影响评估，告知您相关情形，并按照法律法规及不低于本政策所要求的标准继续保护或要求新的控制者继续保护您的个人信息。
      </div>
      <div class="txt">
        3.3
        我们不会对外公开披露收集的个人信息，如必须公开披露时，我们将开展个人信息安全影响评估，向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。
      </div>
      <div class="txt weight">
        3.4
        根据相关法律法规及国家标准，在以下情形中，我们可能会依法共享、转让、公开披露您的个人信息而无需征得您的同意：
        <p>(1) 与个人信息控制者履行法律法规规定的义务相关的；</p>
        <p>(2) 与国家安全、国防安全直接相关的；</p>
        <p>(3) 与公共安全、公共卫生、重大公共利益直接相关的；</p>
        <p>(4) 与刑事侦查、起诉、审判和判决执行等直接相关的；</p>
        <p>
          (5)
          出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；
        </p>
        <p>(6) 个人信息主体自行向社会公众公开的个人信息；</p>
        <p>
          (7)
          从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
        </p>
      </div>
    </div>
    <div class="panel">
      <h3 class="title">四、您如何访问和管理自己的信息</h3>
      <div class="txt">
        您在使用本服务期间，为了您可以更便捷查询、更正、删除您的个人信息，我们在产品中设计了相应操作设置，您可以参考以下指引进行操作。您可联系我们客服进行账号注销及其他访问管理个人信息的权利的咨询、处理。
      </div>
      <div class="txt">
        4.1 查询您的个人信息
        <p>
          (1)
          进入约苗公众号，点击“我的”，在“个人中心-设置”可查询帐号主体相关信息，如头像、电话号码、姓名、性别、出生日期、身份证号码。
        </p>
        <p>
          (2)
          进入约苗公众号后，点击“我的”，在“个人中心-我的订单”可查询我的预约及我的订阅信息，如预约时间、预约门诊、预约疫苗、订阅时间、订阅疫苗等。
        </p>
        <p>
          (3)
          进入约苗公众号后，点击“我的”，在“个人中心-我的服务”可查看我的积分、家庭成员管理、我的收藏信息，如服务通知、系统消息、家庭成员身份信息、收藏门诊等。
        </p>
        <p>
          (4)
          进入约苗公众号后，点击“我的”，在“个人中心-我的服务”可以点击联系客服进行相关问题咨询及处理。
        </p>
      </div>
      <div class="txt">
        4.2 更正您的个人信息
        <p>
          (1)
          进入约苗公众号后，点击“我的”，在“个人中心-设置”中，点击“设置”按钮，可更换您的绑定手机。
        </p>
        <p>
          (2)
          进入约苗公众号后，点击“我的”，在“个人中心-我的订单-我的预约”，点击已预约的订单，可修改您的预约时间。
        </p>
        <p>
          (3)
          进入约苗公众号后，点击“我的”，在“个人中心-我的订单-我的订阅”，点击已订阅的门诊，可取消订阅门诊。
        </p>
        <p>
          (4)
          进入约苗公众号后，点击“我的”，在“个人中心-我的服务-家庭成员管理”，可编辑您的头像、姓名、出生日期、身份证号码、现居地区及详细地址，并增加或删除其他家庭成员信息。
        </p>
      </div>
      <div class="txt">
        4.3注销您的帐号
        <p>
          (1)
          进入约苗公众号后，点击“我的”，在“个人中心-设置-注销账号”页面中，自行注销，或在“个人中心-我的服务-联系客服”页面中，联系我们客服进行账号注销。
        </p>
        <p>
          (2)
          当您注销帐号后，我们将根据适用法律法规的要求，删除或匿名化处理您的个人信息。
        </p>
      </div>
      <div class="txt">
        4.4投诉举报
        <p>
          如您发现我们收集、使用您个人信息的行为，违反了法律法规规定或违反了与您的约定，您可以联系我们客服进行举报、投诉、建议。我们将在十五个工作日内予以回复处理意见或处理结果。
        </p>
      </div>
    </div>
    <div class="panel">
      <h3 class="title">五、我们如何保护未成年人的信息</h3>
      <div class="txt">
        5.1
        我们非常重视对未成年人个人信息的保护。根据相关法律法规的规定，如您是18周岁以下的未成年人，在使用本服务前，请建议您的监护人仔细阅读本隐私政策，并在征得您的监护人同意的前提下使用我们的服务或向我们提供信息。在您注册和使用本服务时，我们默认您已得到您的监护人的同意，我们将根据国家相关法律法规及本隐私政策的规定保护未成年人的个人信息。
      </div>
      <div class="txt">
        5.2
        尽管当地法律和习俗对儿童的定义不同，但我们将不满14周岁的任何人均视为儿童。我们仅会在取得儿童监护人明确同意的情况下收集儿童个人信息，并只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">六、对第三方责任的声明</h3>
      <div class="txt">
        6.1
        本服务若包括链接至第三方提供的产品/服务（包括网站），则该等第三方提供的产品/服务由相关的第三方负责运营。您在使用该等第三方提供的产品/服务时（包括您向该等第三方提供的任何个人信息），须受来自第三方的用户协议及隐私保护政策约束，而非本政策。本政策仅适用于我们所收集的相关信息而不适用于任何第三方提供的产品/服务或第三方的信息使用规则，而我们对任何第三方使用您向其所提供的相关信息不承担任何责任。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">七、本政策的适用及更新</h3>
      <div class="txt">7.1 本隐私政策适用于本服务内所有功能服务。</div>
      <div class="txt">
        7.2 发生下列重大变化情形时，我们会适时对本政策进行更新：
        <p>
          (1) 我们的基本情况发生变化，例如：兼并、收购、重组引起的所有者变更；
        </p>
        <p>(2) 收集、存储、使用个人信息的范围、目的、规则发生变化；</p>
        <p>(3) 对外提供个人信息的对象、范围、目的发生变化；</p>
        <p>(4) 您访问和管理个人信息的方式发生变化；</p>
        <p>(5) 数据安全能力、信息安全风险发生变化；</p>
        <p>
          (6)
          用户询问、投诉的渠道和机制，以及外部纠纷解决机构及联络方式发生变化；
        </p>
        <p>(7) 其他可能对您的个人信息权益产生重大影响的变化。</p>
      </div>
      <div class="txt">
        7.3
        如本政策发生更新，我们将以微信推送通知、弹窗提示、网站公告等方式通知您。为了您能及时接收到通知，建议您在联系方式更新时及时通知我们。
        <span class="weight">
          如您在本政策更新生效后继续使用本服务，即表示您已充分阅读、理解并接受更新后的政策并愿意受更新后的政策约束。
        </span>
      </div>
      <div class="txt">
        7.4
        您可以在本软件服务中查看本政策。我们鼓励您在每次使用本服务时都查阅我们的隐私政策。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">八、联系我们</h3>
      <div class="txt">
        8.1
        我们已设置了隐私政策及信息安全团队并指定专人负责，当您有隐私政策及个人信息保护的投诉、建议或者与本政策相关的问题时，可通过如下方式与我们联系：
        <p>
          (1) 本服务的在线客服功能（点击公众号“我的---我的服务---联系客服”）；
        </p>
        <p>(2) 致电我们：028-85089457；</p>
        <p>(3) 将问题寄送到如下地址： </p>
        中国（四川）自由贸易试验区成都高新区蜀锦路88号2706号
        四川马太科技有限公司（收）/ 客服部（收） 
        <p>邮编：610041</p>
      </div>
      <div class="txt">
        8.2
        我们的客服部门将会尽快审核并会同隐私政策及信息安全团队及时答复您，我们承诺所涉问题将在十五个工作日内予以回复处理意见或处理结果。
      </div>
      <div class="txt">
        8.3 我们的信息：
        <p>公司名称：四川马太科技有限公司</p>
        <p>注册地址：</p>
        <p>中国（四川）自由贸易试验区成都高新区蜀锦路88号</p>
        <p>联系方式：028-85089457</p>
      </div>
      <p class="txt right">四川马太科技有限公司</p>
    </div>
    <!-- 底部按钮组 -->
    <div class="bttom-btn">
      <Button width-type="huge" @click="handleConfirm">确定</Button>
    </div>
  </div>
</template>

<script lang="ts" setup>
import { useRouter } from "vue-router";
import { Button } from "../../index";

const router = useRouter();

// 返回上一页
function handleConfirm() {
  router.go(-1);
}
</script>

<style lang="scss" scoped>
.page {
  text-align: left;
  padding: 20px 20px 95px;
  font-size: 14px;
  @include autoFontFamily(PingFangSC-Regular);
  @include autoFontWeight(400);
  color: #1a2129;
  line-height: 21px;
  background: #fff;
  min-height: 100vh;
  -webkit-overflow-scrolling: touch;

  .title {
    display: block;
    height: 16px;
    font-size: 16px;
    @include autoFontFamily(PingFangSC-Regular);
    @include autoFontWeight(400);
    color: #1a2129;
    line-height: 16px;
    margin: 24px 0px;
  }

  .txt {
    margin-bottom: 20px;
  }

  .weight {
    @include autoFontFamily(PingFangSC-Medium);
  }

  .right {
    text-align: right;
  }
  .bttom-btn {
    width: 100%;
    box-sizing: border-box;
    background-color: #fff;
    position: fixed;
    left: 0;
    bottom: 0;
    display: flex;
    justify-content: center;
    align-items: center;
    padding: 15px 20px;
  }
}
</style>
