<template>
  <div class="page">
    <div class="panel">
      <h3 class="title">一、导言</h3>
      <div class="txt weight">
        1.1
        本协议是您（亦称“用户”）与四川马太科技有限公司（下称“马太科技”或“我们”）之间关于用户使用“约苗”软件或应用网页（下称“约苗”或“本软件”），以及使用“约苗”相关服务（下称“本服务”）所订立的协议。
      </div>
      <div class="txt weight">
        1.2
        马太科技提醒您在使用本服务前认真阅读、充分理解本协议条款、包括但不限于免除或限制马太科技责任的免责条款以及对使用本服务的用户权利的限制条款。请您审慎阅读并确认。
      </div>
      <div class="txt weight">
        1.2.1
        如果您未满18周岁，请务必在家长和其他法定监护人的陪同下阅读本协议，并在进行注册、下单、支付等任何行为或使用约苗的其他任何服务前，应事先征得您的家长和其他法定监护人的同意。
      </div>
      <div class="txt weight">
        1.2.2
        您知悉并承诺，您具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力但已经过您的家长和其他法定监护人同意并由您的家长和其他法定监护人代理注册及使用约苗的各项服务。若您不具备前述相适应的民事行为能力即进行账号注册的，则您及您的家长和其他法定监护人应依照法律规定承担因此而导致的一切后果。
      </div>
      <div class="txt weight">
        1.3
        您使用本服务即视为您已阅读并同意本协议条款。马太科技有权在必要时修改本协议条款，并公示于本服务。您可以在本服务的最新版本中查阅相关协议条款。本协议条款变更后，如您继续使用本服务，视作您已接受修改后的协议。
      </div>
      <div class="txt weight">
        1.4
        对于本服务会如何保护您的个人信息，请您阅读《隐私政策》予以进一步了解。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">二、账号注册与使用</h3>
      <div class="txt">
        2.1
        在您使用约苗提供相关服务前，需要向约苗提供相关注册资料。您应遵循诚实信用、合法善意的原则，向约苗提交相关注册资料，相关注册资料应当遵守法律法规、国家利益、公民合法权益、公序良俗、信息真实等原则，不应提交任何违法或不良信息，相关资料如有变动，您应及时更新。
        <span class="weight">
          如果因您所提供的注册资料不合法、不真实、不准确或未及时更新，从而导致相关法律责任或不利后果的，您将承担相应的法律责任及不利后果。
        </span>
      </div>
      <p class="txt weight">
        2.2
        您知悉并承诺，您具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力但已经过您的家长和其他法定监护人同意并由您的家长和其他法定监护人代理注册及使用马太科技的各项服务。若您不具备前述相适应的民事行为能力即进行账号注册的，则您及您的家长和其他法定监护人应依照法律规定承担因此而导致的一切后果。
      </p>
      <div class="txt">
        2.3
        约苗将对您所提交的注册信息予以保护，不会将其披露给任何非关联的第三方，
        <span class="weight">除非：</span>
        <p>(1) 相关法律法规或国家机关要求；</p>
        <p>(2) 约苗发生相关合并、分立、收购或资产转移；</p>
        <p>(3) 为提供相关服务所必须的。</p>
        对于您所提交的注册信息中涉及个人信息的内容，约苗将严格按照《隐私政策》的规定进行收集、处理和使用。
      </div>
      <p class="txt weight">
        2.4您应对您账号项下的所有行为（包括但不限于在线签署任何协议，浏览、购买、支付、上传、发布、输入任何内容）所产生的一切后果负责，通过您的账号所发生的上述各项行为将视为您本人的真实意思表示。
      </p>
    </div>
    <div class="panel">
      <h3 class="title">三、权利义务及责任承担</h3>
      <div class="txt">
        3.1
        本服务为您提供疾病预防相关互联网信息服务，包括但不限于预防接种预约服务、体检筛查预约服务、健康科普服务、订阅提醒服务。
        <span class="weight"
          >马太科技保留随时新增、变更、中断或终止部分或全部服务的权利。</span
        >
      </div>
      <p class="txt weight">
        3.2
        除特别说明外，“约苗”不断推出的新功能、新服务，均适用本协议之规范。如本服务中某一特定功能服务另有单独协议，则该单独协议为本协议之补充，您使用该特定服务即视为同意本协议及单独协议。
      </p>
      <p class="txt weight">
        3.3
        本服务所提供的信息，仅供参考之用。您应对本服务中的信息自行加以判断，并承担因使用信息或依照信息所作行为而引起的所有风险，包括因对信息的正确性、完整性、实用性或个案适用性的依赖而产生的风险。马太科技无法且不会对因前述风险而导致的任何损失或损害承担责任。
      </p>
      <p class="txt weight">
        3.3.1
        您知晓并同意，本软件为独立的第三方互联网平台，在本软件上展示的由第三方提供的服务相关信息（包括地址、服务时间、电话等），均由服务机构提供；如与实际情况不符（包括用户预约到场后出现无法提供服务等情况），马太科技无须为此承担任何责任。如您在服务机构接受服务过程中，发生接种事故或其他医疗事故、遭受第三方侵权或其他人身伤亡或财产损失的情形，抑或在接种后产生的疑似预防接种异常反应、耦合症等，均与马太科技无关。
      </p>
      <p class="txt weight">
        3.3.2
        您知晓并同意，本服务所提供的疾病预防、预防接种等相关科普知识，仅作一般参考，不作为任何医学诊断、治疗或用药依据，如用户出现有关症状，或需获得诊断或治疗，应尽早前往医院就医，并以专业医生诊断意见为准；若擅自将相关信息或咨询建议作为诊治、救护措施或处方用药依据使用，由此产生的一切风险或损失，与马太科技无关。
      </p>
      <p class="txt weight">
        3.4
        本服务中可能存在为向用户提供便利而设置的外部链接，马太科技将尽力要求第三方提供外部链接的准确性、完整性和安全性，但马太科技无法保证第三方行为以及该等外部链接指向的不由本服务实际控制的任何网页上的内容，对此马太科技不承担任何责任。
      </p>
      <div class="txt">
        3.5 马太科技保留自行决定更正本服务中任何部分的任何错误或遗漏的权利。
      </div>
      <div class="txt weight">
        3.6
        用户不得通过本服务传播、传送任何违法违规、违反社会公德、侵犯他人权益、干扰本软件及服务正常运营或带有广告、营销信息、垃圾信息、骚扰信息、淫秽信息、虚假不实信息等的内容，包括但不限于：
        <p class="weight">(1) 违反宪法确定的基本原则的；</p>
        <p>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
        <p>(3) 损害国家荣誉和利益的；</p>
        <p>(4) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
        <p>(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
        <p>(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
        <p>(7) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p>
        <p>(8) 侮辱或者诽谤他人，侵害他人合法权益的；</p>
        <p>(9) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；</p>
        <p>(10) 以非法民间组织名义活动的；</p>
        <p>
          (11)
          不符合法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；
        </p>
        <p>(12) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；</p>
        <p>(13) 涉及他人隐私、个人信息或资料的；</p>
        <p>
          (14)
          含有软件病毒、蠕虫、木马或其他有害的计算机代码、文件、脚本、代理或程序的资料；
        </p>
        <p>(15) 其他根据法律法规及本条款约定禁止的信息内容。</p>
      </div>
      <div class="txt weight">
        3.6.1除非法律允许或马太科技书面许可，您使用本服务过程中不得从事下列行为：
        <p>
          (1)
          对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；
        </p>
        <p>
          (2)
          对马太科技拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
        </p>
        <p>
          (3)
          对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经马太科技授权的第三方工具/服务接入本软件和相关系统；
        </p>
        <p>
          (4)
          通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
        </p>
        <p>
          (5)
          通过非马太科技开发、授权的第三方软件、插件、外挂、系统，登录或使用马太科技软件及服务，或制作、发布、传播上述工具；
        </p>
        <p>
          (6) 自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；
        </p>
        <p>(7) 删除本软件上关于著作权的信息；</p>
        <p>(8) 其他未经马太科技明示授权的行为。</p>
      </div>
      <div class="txt weight">
        3.6.2除非法律允许或马太科技书面许可，您使用本服务过程中不得从事下列行为：
        <p>(1) 提交、发布虚假信息，或冒充、利用他人名义的；</p>
        <p>(2) 诱导其他用户点击链接页面或分享信息的；</p>
        <p>(3) 虚构事实、隐瞒真相以误导、欺骗他人的；</p>
        <p>(4) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；</p>
        <p>(5) 未经马太科技书面许可利用本服务任何功能进行推广或互相推广的；</p>
        <p>(6) 利用本软件及服务从事任何违法犯罪活动的；</p>
        <p>
          (7)
          制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；
        </p>
        <p>
          (8)
          其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或马太科技未明示授权的行为。
        </p>
      </div>
      <p class="txt weight">
        3.7
        您理解并同意，马太科技有权依合理判断对违反有关法律法规或本协议规定的行为进行处理，对违法违规的任何用户采取收回、注销账号的行为并采取适当的法律措施，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任，包括但不限于因此导致第三方的损失、马太科技的损失等。
      </p>
      <p class="txt weight">
        3.8
        在法律允许的范围内，马太科技对以下不可掌控的情形导致的服务无法正常使用及其引发的结果不承担责任：
      </p>
      <p class="txt weight">
        3.8.1
        不可抗力（包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等）；
      </p>
      <p class="txt weight">
        3.8.2 受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
      </p>
      <p class="txt weight">3.8.3 电脑软件、系统、硬件和通信线路出现故障；</p>
      <p class="txt weight">3.8.4 电信部门技术调整或故障；</p>
      <p class="txt weight">
        3.8.5
        因系统维护、升级需要而造成的暂时中断，但马太科技将尽力及时恢复，减少不利影响；
      </p>
      <p class="txt weight">3.8.6 因其他第三方原因导致的；</p>
      <p class="txt weight">3.8.7 用户自身的操作不当；</p>
      <p class="txt weight">
        3.8.8
        由于网络信号不稳定、带宽小等原因，所引起的登录失败、页面打开速度慢等风险；
      </p>
      <p class="txt weight">3.8.9 其他马太科技无法控制或合理预见的情形。</p>
    </div>
    <div class="panel">
      <h3 class="title">四、知识产权</h3>
      <p class="txt weight">
        4.1
        马太科技拥有本服务内所有内容（含软件本身）的知识产权或相关权益，所有这些内容受著作权、商标权、专利权和其它财产所有权法律的保护。任何人只有在获得马太科技或所有权人的书面授权之后才能使用这些内容，而不能擅自复制、修改、制作衍生产品、进行还原工程、反向编译，或以其它方式转移任何权利，或用于任何商业目的。
      </p>
      <p class="txt weight">
        4.2
        用户在此同意，除用户在上传或发布时特别声明保留具体权利的以外，将其在任何时间段发表在“约苗”服务中的任何形式的信息内容的著作权的财产性权利（如复制权、发行权、出租权、展览权、信息网络传播权、改编权、翻译权、汇编权等），全部独家地、永久免费地、不可撤销地转让给马太科技，且马太科技有权将上述权利让渡给其它个人、组织或机构。本协议已构成《中华人民共和国著作权法》及相关法律法规规定的财产性著作权转让书面协议，无论该等内容形成于本协议订立前还是订立后。同时，用户同意一并将上述信息内容中包含的肖像权（如有）无条件无期限授予马太科技在“约苗”及相关服务中使用。
      </p>
    </div>
    <div class="panel">
      <h3 class="title">五、协议终止（账号注销、内容）</h3>
      <div class="txt weight">
        5.1 本服务协议于以下任一情形下终止：
        <p>
          (1)
          马太科技有权依据本服务协议约定，收回、注销用户账号，此情形下，本服务协议于账号收回、注销之日终止；
        </p>
        <p>
          (2)
          在您满足约苗的账号注销条件时，您通过约苗的客服注销约苗的用户账号，本服务协议于账号注销之日终止。您理解并同意，您已认真阅读、认可《隐私政策》，并已了解、同意相关用户注销流程及注销后的权利义务安排；
        </p>
        <p>
          (3)
          马太科技有权根据自身商业安排经过合理的提前通知终止全部服务，本服务协议于约苗全部服务依法定程序及方式终止之日终止。
        </p>
      </div>
      <p class="txt weight">
        5.2
        本服务协议终止后，马太科技将无法继续向您提供任何服务或履行任何其他义务，包括但不限于为您保留或向您披露其原约苗账号中的任何信息，向您或第三方转发任何未曾阅读或发送过的信息等。
      </p>
      <div class="txt">
        5.3
        本服务协议的终止不影响第四条知识产权条款以及其他根据其内容应继续有效的条款的有效性，也不影响本服务协议终止前各方的相关权利和义务，包括但不限于守约方依据本服务协议向违约方追究相应的违约责任。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">六、通知与送达</h3>
      <div class="txt">
        6.1
        您知悉并认可马太科技可视情况通过下列任意一种或几种方式向您通知重要信息：
        <p>(1) 向您注册时所提交的手机号码发送电子信息；</p>
        <p>(2) 向您提供的实际地址进行寄送纸质载体信息；</p>
        <p>(3) 在网站或客户端显著位置刊登电子信息；</p>
        <p>
          (4)
          向约苗网站或相应客户端的账户的站内信或其他即时通信客户端发送电子信息。
        </p>
      </div>
      <div class="txt">
        6.2
        上述电子信息在发送成功或刊登完成后即视为送达。相关纸质载体的发送以相关邮寄凭证上的邮寄日期后的第五个自然日视为送达。
      </div>
      <div class="txt">
        6.3
        上述送达方式同样可适用于相关仲裁或司法程序（含起诉、审理、执行等各阶段）。
      </div>
      <div class="txt">
        您应当保证所提供的联系方式是准确、有效的，并进行适时更新，如因提供的联系方式不准确或怠于更新等不可归责于美团点评的原因，导致相关通知、文件、文书无法送达或及时送达，您将自行承担由此可能产生的法律后果。
      </div>
    </div>
    <div class="panel">
      <h3 class="title">七、其他</h3>
      <div class="txt">
        <p class="weight">7.1 本协议签订地约定为成都。</p>
         
        <p>
          7.2
          本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律（不包括冲突法）。
        </p>
         
        <p class="weight">
          7.3
          若您和四川马太科技有限公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交四川马太科技有限公司住所地即成都市高新技术开发区人民法院管辖。
        </p>
         
        <p>
          7.4
          本协议任何一方于另一方过失或违约时放弃本协议规定的权利的，不得视为其对一方的其他或以后同类之过失或违约行为弃权。
        </p>
         
        <p class="weight">
          7.5
          四川马太科技有限公司未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。
        </p>
         
        <div class="weight">
          7.6 关于我们
          <p>
            本服务提供者：四川马太科技有限公司，如您对本协议及《隐私政策》有任何疑问、投诉、意见或建议，请通过如下方式与我们联系：
          </p>
          <p>电话：028-85089457</p>
          <p>邮箱：gzh@healthych.com</p>
          <p>
            当您与我们联系时，我们可能会保存您的通信/通话记录和内容、联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。
          </p>
        </div>
      </div>
      <p class="txt right">四川马太科技有限公司</p>
    </div>
    <!-- 底部按钮组 -->
    <div class="bttom-btn">
      <Button width-type="huge" @click="handleConfirm">确定</Button>
    </div>
  </div>
</template>

<script lang="ts" setup>
import { useRouter } from "vue-router";
import { Button } from "../../index";

const router = useRouter();

// 返回上一页
function handleConfirm() {
  router.go(-1);
}
</script>

<style lang="scss" scoped>
.page {
  text-align: left;
  padding: 20px 20px 95px;
  font-size: 14px;
  @include autoFontFamily(PingFangSC-Regular);
  @include autoFontWeight(400);
  color: #1a2129;
  line-height: 21px;
  background: #fff;
  min-height: 100vh;
  -webkit-overflow-scrolling: touch;

  .title {
    display: block;
    height: 16px;
    font-size: 16px;
    @include autoFontFamily(PingFangSC-Regular);
    @include autoFontWeight(400);
    color: #1a2129;
    line-height: 16px;
    margin: 24px 0px;
  }

  .txt {
    margin-bottom: 20px;
  }

  .weight {
    @include autoFontFamily(PingFangSC-Medium);
  }

  .right {
    text-align: right;
  }
  .bttom-btn {
    width: 100%;
    box-sizing: border-box;
    background-color: #fff;
    position: fixed;
    left: 0;
    bottom: 0;
    display: flex;
    justify-content: center;
    align-items: center;
    padding: 15px 20px;
  }
}
</style>
